app/views/messages/_message.html.erb

SELECT "messages".* FROM "messages" WHERE (id < 1) ORDER BY "messages"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
      <% unless message.room.is_private %>
        <% unless message.previous_message.present? && message.previous_message.user_id.eql?(message.user.id) %>

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ? ORDER BY "messages"."created_at" ASC  [["room_id", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <% end %>
      <div class="flex flex-col <%= message.previous_message.present? && message.previous_message.user_id.eql?(message.user.id) && message.room&.is_private.eql?(false) ? 'ml-5' : '' %>">

INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["room_id", 1], ["body", "PULANGG!!"], ["created_at", "2023-11-05 19:45:12.792011"], ["updated_at", "2023-11-05 19:45:12.792011"]]
---
          <div><%= message.body %></div>
          <div class="text-[9px] flex items-end min-w-[45px] text-gray-400"><%= message.created_at.strftime("%H.%M %p") %></div>