app/controllers/rooms_controller.rb

  def set_status
    current_user.update!(status: User.statuses[:online]) if current_user
---
UPDATE "users" SET "updated_at" = ?, "status" = ? WHERE "users"."id" = ?  [["updated_at", "2023-11-05 19:43:57.024432"], ["status", 2], ["id", 2]]