app/models/message.rb

  def confirm_participant
    return unless room.is_private

    is_participant = Participant.where(user_id: user.id, room_id: room.id).first
---
SELECT "participants".* FROM "participants" WHERE "participants"."user_id" = ? AND "participants"."room_id" = ? ORDER BY "participants"."id" ASC LIMIT ?  [["user_id", 3], ["room_id", 1], ["LIMIT", 1]]

  def previous_message
    Message.where("id < ?", self.id).last
---
SELECT "messages".* FROM "messages" WHERE (id < 1) ORDER BY "messages"."id" DESC LIMIT ?  [["LIMIT", 1]]