app/models/room.rb

  def self.create_private_room(users, room_name)
    single_room = Room.create(name: room_name, is_private: true)
    users.each do |user|
      Participant.create(user_id: user.id, room_id: single_room.id)
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "private_1_2"], ["is_private", 1], ["created_at", "2023-11-05 20:16:39.569701"], ["updated_at", "2023-11-05 20:16:39.569701"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 1], ["created_at", "2023-11-05 20:16:39.591873"], ["updated_at", "2023-11-05 20:16:39.591873"]]

  def participant?(room, user)
    room.participants.where(user: user).exists?
---
SELECT 1 AS one FROM "participants" WHERE "participants"."room_id" = ? AND "participants"."user_id" = ? LIMIT ?  [["room_id", 1], ["user_id", 1], ["LIMIT", 1]]